capiTemp/CFD/0/CSource
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.05";
    object      CSource;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0;  

boundaryField
{
    inlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    wall
    {
        type            zeroGradient;
        value           uniform 0;
    }
}


// ************************************************************************* //
